# ElementIsCurveDrivenFilter Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementIsCurveDrivenFilter Constructor
ElementIsCurveDrivenFilter Class See Also
---
Constructs a new instance of a filter to match only curve driven elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ElementIsCurveDrivenFilter()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ElementIsCurveDrivenFilter()
```

# Remarks
The term "curve driven" indicates that the element's Location property is a LocationCurve. Example elements found by this filter include walls, beams, and curve elements.
# See Also
ElementIsCurveDrivenFilter Class
ElementIsCurveDrivenFilter Overload
Autodesk.Revit.DB Namespace